[
  {
    "tag": "CV_Tips",
    "patterns": [
      "Bagaimana cara membuat CV yang bagus?",
      "Apa yang perlu diperhatikan saat membuat CV?",
      "Cara bikin CV yang menarik?"
    ],
    "responses": [
      "Untuk membuat CV yang bagus, Anda bisa memperhatikan beberapa poin seperti penulisan ringkas, penggunaan bahasa yang jelas, penekanan pada pengalaman relevan, dan tata letak yang bersih dan mudah dibaca."
    ]
  },
  {
    "tag": "Wawancara_Tips",
    "patterns": [
      "Apa tips yang bisa membantu sebelum wawancara?",
      "Bagaimana cara mempersiapkan diri sebelum wawancara?",
      "Saya butuh tips untuk wawancara kerja."
    ],
    "responses": [
      "Beberapa tips sebelum wawancara yang bisa membantu adalah melakukan riset tentang perusahaan, latihan menjawab pertanyaan umum, mempersiapkan pertanyaan untuk pewawancara, dan memastikan penampilan dan sikap yang profesional."
    ]
  },
  {
    "tag": "Kelemahan_Saat_Wawancara",
    "patterns": [
      "Bagaimana cara menjawab pertanyaan 'kelemahan Anda' saat wawancara?",
      "Apa yang sebaiknya dikatakan saat diminta untuk menyebutkan kelemahan dalam wawancara?"
    ],
    "responses": [
      "Saat menjawab pertanyaan ini, penting untuk mengakui kelemahan namun juga menunjukkan bagaimana Anda berusaha untuk mengatasinya. Contohnya, Anda bisa menyebutkan kelemahan tetapi menyertakan bagaimana Anda terus belajar dan berkembang untuk mengatasinya."
    ]
  },
  {
    "tag": "Penampilan_Wawancara",
    "patterns": [
      "Apa yang sebaiknya diperhatikan terkait penampilan saat wawancara?",
      "Apa baju atau setelan yang cocok untuk wawancara?"
    ],
    "responses": [
      "Penampilan sangatlah penting saat wawancara. Pastikan untuk berpakaian rapi dan sesuai dengan budaya perusahaan yang Anda lamar. Selain itu, jaga sikap dan perilaku agar terlihat profesional dan percaya diri."
    ]
  },
  {
    "tag": "Menjawab_Pertanyaan_Wawancara",
    "patterns": [
      "Bagaimana cara memberikan jawaban yang baik saat wawancara?",
      "Cara menjawab pertanyaan wawancara dengan baik."
    ],
    "responses": [
      "Untuk memberikan jawaban yang baik, dengarkan pertanyaan dengan seksama, berikan jawaban yang jelas dan konkret, dan tunjukkan contoh dari pengalaman atau keahlian yang relevan dengan pertanyaan tersebut."
    ]
  },
  {
    "tag": "Follow_Up_Wawancara",
    "patterns": [
      "Apakah follow-up setelah wawancara penting?",
      "Bagaimana cara melakukan follow-up setelah wawancara?"
    ],
    "responses": [
      "Follow-up setelah wawancara bisa memberikan kesan positif tambahan kepada pewawancara. Anda dapat mengirimkan email ucapan terima kasih, menanyakan status proses seleksi, dan menegaskan minat Anda terhadap posisi yang dilamar."
    ]
  },
  {
    "tag": "Interview_Preparation",
    "patterns": [
      "Bagaimana cara mempersiapkan diri sebelum wawancara?",
      "Saya butuh tips untuk persiapa wawancara kerja."
    ],
    "responses": [
      "Beberapa tips sebelum wawancara yang bisa membantu adalah melakukan riset tentang perusahaan, latihan menjawab pertanyaan umum, mempersiapkan pertanyaan untuk pewawancara, dan memastikan penampilan dan sikap yang profesional."
    ]
  },
  {
    "tag": "Handling_Stress_Interview",
    "patterns": [
      "Bagaimana cara mengatasi stres saat wawancara?",
      "Apa tips untuk menghadapi wawancara yang menegangkan?"
    ],
    "responses": [
      "Untuk mengatasi stres saat wawancara, penting untuk melakukan latihan pernapasan, fokus pada pertanyaan yang diajukan, dan ingatkan diri bahwa wawancara adalah kesempatan untuk menunjukkan kemampuan Anda."
    ]
  },
  {
    "tag": "Handling_Gugup_Interview",
    "patterns": [
      "Bagaimana cara mengatasi gugup saat wawancara?",
      "Apa tips jika gagap atau tidak lancar berbicara saat berbicara?"
    ],
    "responses": [
      "Untuk mengatasi stres saat wawancara, penting untuk melakukan latihan pernapasan, fokus pada pertanyaan yang diajukan, dan ingatkan diri bahwa wawancara adalah kesempatan untuk menunjukkan kemampuan Anda."
    ]
  },
  {
    "tag": "Closing_Statement",
    "patterns": [
      "Apakah penting memiliki closing statement dalam wawancara?",
      "Bagaimana cara membuat closing statement yang efektif?"
    ],
    "responses": [
      "Closing statement dapat meninggalkan kesan yang baik. Sampaikan kesan terima kasih, tanyakan tentang langkah selanjutnya, dan pastikan pewawancara memiliki pemahaman yang kuat tentang mengapa Anda cocok untuk posisi tersebut."
    ]
  },
  {
    "tag": "Menghadapi_Pertanyaan_Tertentu",
    "patterns": [
      "Bagaimana cara menjawab pertanyaan 'ceritakan tentang diri Anda'?",
      "Tips menjawab pertanyaan 'tell me about yourself' dalam wawancara."
    ],
    "responses": [
      "Untuk menjawab pertanyaan ini, fokuslah pada pengalaman dan keterampilan yang relevan dengan pekerjaan yang dilamar. Ceritakan secara singkat tentang latar belakang, pendidikan, pengalaman kerja, dan bagaimana itu terkait dengan pekerjaan yang diinginkan."
    ]
  },
  {
    "tag": "Reschedule_Interview",
    "patterns": [
      "Bagaimana cara meyakinkan perekrut untuk mereschedule wawancara?",
      "Apa yang sebaiknya dilakukan jika tidak bisa hadir dalam jadwal wawancara yang sudah ditetapkan?"
    ],
    "responses": [
      "Jika perlu mereschedule, berikan pemberitahuan secepatnya. Sampaikan alasan yang jelas dan minta maaf atas ketidaknyamanan yang ditimbulkan. Ajukan opsi lain untuk jadwal yang dapat diterima oleh kedua belah pihak."
    ]
  },
  {
    "tag": "Post_Interview_Thank_You",
    "patterns": [
      "Apakah penting mengirimkan ucapan terima kasih setelah wawancara?",
      "Bagaimana cara yang tepat untuk mengirimkan ucapan terima kasih setelah wawancara?"
    ],
    "responses": [
      "Mengirimkan ucapan terima kasih setelah wawancara dapat meninggalkan kesan positif tambahan. Kirimkan email atau surat ucapan terima kasih, tunjukkan apresiasi atas kesempatan wawancara, dan sampaikan keinginan Anda untuk berkontribusi di perusahaan tersebut."
    ]
  },
  {
    "tag": "Handling_Tricky_Questions",
    "patterns": [
      "Bagaimana cara menangani pertanyaan wawancara yang sulit?",
      "Apa yang sebaiknya dilakukan jika mendapatkan pertanyaan yang sulit saat wawancara?"
    ],
    "responses": [
      "Saat mendapat pertanyaan sulit, jangan panik. Berikan diri Anda sedikit waktu untuk berpikir, jelaskan proses berpikir Anda, dan fokuskan jawaban pada pembelajaran atau cara Anda menghadapi situasi sulit sebelumnya."
    ]
  },
  {
    "tag": "Researching_Company",
    "patterns": [
      "Mengapa penting melakukan riset tentang perusahaan sebelum wawancara?",
      "Apa yang perlu diketahui tentang perusahaan sebelum wawancara?"
    ],
    "responses": [
      "Riset tentang perusahaan membantu Anda memahami budaya, nilai, dan visi perusahaan. Hal ini memungkinkan Anda untuk menyesuaikan jawaban Anda dengan nilai perusahaan, dan menunjukkan minat serta keseriusan Anda terhadap posisi yang dilamar."
    ]
  },
  {
    "tag": "Body_Language_Interview",
    "patterns": [
      "Bagaimana cara menunjukkan bahasa tubuh yang baik saat wawancara?",
      "Apakah penting menunjukkan bahasa tubuh yang positif saat wawancara?"
    ],
    "responses": [
      "Bahasa tubuh dapat memberikan kesan yang kuat. Pastikan untuk menjaga kontak mata, postur tubuh yang tegap, dan tunjukkan ekspresi wajah yang ramah dan percaya diri selama wawancara."
    ]
  },
  {
    "tag": "Handling_Weaknesses",
    "patterns": [
      "Bagaimana cara menjelaskan kelemahan Anda dengan positif saat wawancara?",
      "Apa yang sebaiknya dikatakan saat diminta untuk menyebutkan kelemahan dalam wawancara?"
    ],
    "responses": [
      "Saat menjawab pertanyaan ini, penting untuk mengakui kelemahan namun juga menunjukkan bagaimana Anda berusaha untuk mengatasinya. Contohnya, Anda bisa menyebutkan kelemahan tetapi menyertakan bagaimana Anda terus belajar dan berkembang untuk mengatasinya."
    ]
  },
  {
    "tag": "Handling_Conflict",
    "patterns": [
      "Bagaimana cara menghadapi pertanyaan terkait konflik di tempat kerja dalam wawancara?",
      "Apa yang sebaiknya dilakukan saat diminta untuk menceritakan pengalaman konflik dalam wawancara?"
    ],
    "responses": [
      "Saat menjawab pertanyaan tentang konflik, berfokus pada penyelesaian masalah. Jelaskan situasi dengan jujur, tetapi fokus pada langkah-langkah yang Anda ambil untuk menyelesaikan konflik tersebut dan pelajaran yang didapat dari pengalaman tersebut."
    ]
  },
  {
    "tag": "Wawancara_Remote",
    "patterns": [
      "Cara mempersiapkan diri untuk wawancara online?",
      "Apa yang perlu diperhatikan saat wawancara online daring?"
    ],
    "responses": [
      "Untuk wawancara remote, pastikan koneksi internet yang stabil, lingkungan yang tenang, dan pencahayaan yang baik. Gunakan platform yang diberikan dengan baik, dan pastikan untuk memperhatikan penampilan dan sikap yang profesional."
    ]
  },
  {
    "tag": "Memilih_Pertanyaan",
    "patterns": [
      "Apakah saya boleh bertanya pada pewawancara atau HRD?",
      "Apakah bertanya diperbolehkan dalam wawancara?"
    ],
    "responses": [
      "Pertanyaan pada pewawancara menunjukkan minat Anda terhadap posisi dan perusahaan. Tanyakan tentang tanggung jawab pekerjaan, budaya perusahaan, atau peluang pengembangan di perusahaan tersebut."
    ]
  },
  {
    "tag": "Handling_Rejection",
    "patterns": [
      "Bagaimana cara mengatasi rasa penolakan setelah wawancara?",
      "Apa yang sebaiknya dilakukan setelah mendapat kabar bahwa tidak lolos wawancara?"
    ],
    "responses": [
      "Menerima penolakan adalah bagian dari proses. Gunakan kesempatan ini untuk belajar, minta umpan balik jika mungkin, dan tetaplah positif. Perlu diingat bahwa penolakan bukan berarti kegagalan, namun peluang untuk mencari kesempatan yang lebih baik."
    ]
  },
  {
    "tag": "Salary_Question",
    "patterns": [
      "Bagaimana cara menjawab saat ditanyakan gaji yang diminta?",
      "Cara menjawab pertanyaan tentang gaji yang diharapkan atau diinginkan?"
    ],
    "responses": [
      "Bernegosiasi gaji adalah hal yang umum. Lakukan riset tentang kisaran gaji yang sesuai dengan posisi dan pengalaman Anda. Sampaikan secara jelas keinginan Anda, tetapi berikan ruang untuk bernegosiasi."
    ]
  },
  {
    "tag": "Salary_Negotiation",
    "patterns": [
      "Bagaimana cara bernegosiasi gaji setelah wawancara?",
      "Cara negosiasi gaji yang baik"
    ],
    "responses": [
      "Bernegosiasi gaji adalah hal yang umum. Lakukan riset tentang kisaran gaji yang sesuai dengan posisi dan pengalaman Anda. Sampaikan secara jelas keinginan Anda, tetapi berikan ruang untuk bernegosiasi."
    ]
  },
  {
    "tag": "Lowongan_Kerja",
    "patterns": [
      "Apakah ada saran tempat mencari lowongan kerja?",
      "Apakah ada saran web atau platform untuk mencari lowongan kerja?"
    ],
    "responses": [
      "Coba eksplorasi situs web seperti LinkedIn, Indeed, dan Glassdoor. Sesuaikan pencarian dengan keahlian dan minat Anda."
    ]
  },
  {
    "tag": "Menyusun_Portfolio",
    "patterns": [
      "Apa yang sebaiknya dimasukkan dalam portfolio untuk wawancara?",
      "Portofolio seperti apa yang bagus?",
      "Portofolio yang menarik"
    ],
    "responses": [
      "Portfolio adalah alat yang baik untuk menunjukkan karya atau proyek Anda. Sertakan proyek yang relevan, dokumentasi yang jelas, dan ceritakan bagaimana Anda berkontribusi dalam setiap proyek tersebut."
    ]
  },
  {
    "tag": "Keterampilan_Presentasi",
    "patterns": [
      "Apa yang sebaiknya dilakukan untuk meningkatkan keterampilan presentasi sebelum wawancara?",
      "Bagaimana cara meningkatkan kemampuan presentasi untuk wawancara?"
    ],
    "responses": [
      "Untuk meningkatkan keterampilan presentasi, latihan adalah kunci. Latihan presentasi tentang diri Anda, keterampilan Anda, dan pengalaman Anda sehingga dapat menyampaikannya dengan percaya diri dan jelas."
    ]
  },
  {
    "tag": "Avoiding_Common_Mistakes",
    "patterns": [
      "Apa kesalahan umum yang sebaiknya dihindari dalam wawancara?",
      "Bagaimana cara menghindari kesalahan yang sering terjadi saat wawancara?"
    ],
    "responses": [
      "Hindari terlambat datang, kurangnya pengetahuan tentang perusahaan, jawaban yang terlalu umum, dan sikap yang tidak profesional. Persiapkan diri sebaik mungkin dan berikan kesan yang baik kepada pewawancara."
    ]
  },
  {
    "tag": "Persiapan_Wawancara",
    "patterns": [
      "Apa yang perlu dipersiapkan sebelum wawancara?",
      "Dokumen apa saja yang perlu dipersiapkan sebelum wawancara?"
    ],
    "responses": [
      "Sebelum melakukan wawancara, pastikan untuk mempersiapkan CV, portfolio, dan pertanyaan untuk pewawancara. Selain itu, lakukan riset tentang perusahaan dan posisi yang dilamar, dan pastikan untuk mempersiapkan penampilan dan sikap yang profesional."
    ]
  }
  
]