{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                10
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "embedding_1_input"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                10
              ],
              "input_dim": 2381,
              "output_dim": 16,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 10
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.7,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "binary_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_2/kernel",
          "shape": [
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            32,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_1/embeddings",
          "shape": [
            2381,
            16
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}